
# State **`s3://infrahouse-aws-control-493370826424/terraform.tfstate`**
## Affected resources counts

|   Success |   🟢 Add |   🟡 Change |    Destroy |
|----------:|---------:|------------:|-----------:|
|        ✅ |        2 |          12 |          0 |
## Affected resources by action

|  Action  | Resources                                                                           |
|:--------:|:------------------------------------------------------------------------------------|
|    🟢    | `module.infrahouse-github-backup-app-key.aws_secretsmanager_secret.secret`          |
|    🟢    | `module.infrahouse-github-backup-app-key.aws_secretsmanager_secret_version.current` |
|    🟡    | `module.ecs.aws_ecs_capacity_provider.ecs`                                          |
|    🟡    | `module.ecs.aws_ecs_cluster.ecs`                                                    |
|    🟡    | `module.ecs.aws_ecs_service.ecs`                                                    |
|    🟡    | `module.ecs.aws_ecs_task_definition.ecs`                                            |
|    🟡    | `module.ecs.aws_iam_role.ecs_task_execution_role`                                   |
|    🟡    | `module.keycloak.aws_ecs_capacity_provider.ecs`                                     |
|    🟡    | `module.keycloak.aws_ecs_cluster.ecs`                                               |
|    🟡    | `module.keycloak.aws_ecs_service.ecs`                                               |
|    🟡    | `module.keycloak.aws_ecs_task_definition.ecs`                                       |
|    🟡    | `module.keycloak.aws_iam_role.ecs_task_execution_role`                              |
|    🟡    | `module.ecs.module.pod.aws_autoscaling_group.website`                               |
|    🟡    | `module.keycloak.module.pod.aws_autoscaling_group.website`                          |
<details>
<summary>STDOUT</summary>

```
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # module.ecs.aws_ecs_capacity_provider.ecs will be updated in-place
  ~ resource "aws_ecs_capacity_provider" "ecs" {
        id       = "arn:aws:ecs:us-west-1:493370826424:capacity-provider/terraform-registry"
        name     = "terraform-registry"
      ~ tags     = {
            "account"           = "493370826424"
            "created_by_module" = "infrahouse/ecs/aws"
            "environment"       = "development"
          ~ "module_version"    = "3.7.0" -> "3.8.0"
            "service"           = "terraform-registry"
        }
      ~ tags_all = {
          ~ "module_version"    = "3.7.0" -> "3.8.0"
            # (5 unchanged elements hidden)
        }
        # (1 unchanged attribute hidden)

        # (1 unchanged block hidden)
    }

  # module.ecs.aws_ecs_cluster.ecs will be updated in-place
  ~ resource "aws_ecs_cluster" "ecs" {
        id       = "arn:aws:ecs:us-west-1:493370826424:cluster/terraform-registry"
        name     = "terraform-registry"
      ~ tags     = {
            "account"           = "493370826424"
            "created_by_module" = "infrahouse/ecs/aws"
            "environment"       = "development"
          ~ "module_version"    = "3.7.0" -> "3.8.0"
            "service"           = "terraform-registry"
        }
      ~ tags_all = {
          ~ "module_version"    = "3.7.0" -> "3.8.0"
            # (5 unchanged elements hidden)
        }
        # (1 unchanged attribute hidden)

        # (1 unchanged block hidden)
    }

  # module.ecs.aws_ecs_service.ecs will be updated in-place
  ~ resource "aws_ecs_service" "ecs" {
        id                                 = "arn:aws:ecs:us-west-1:493370826424:service/terraform-registry/terraform-registry"
        name                               = "terraform-registry"
      ~ tags                               = {
            "account"                         = "493370826424"
            "backend_security_group"          = "eyJiYWNrZW5kIjp7ImlkIjoic2ctMDRiOTM2MzgzNGUxM2EyM2UiLCJydWxlcyI6eyJiYWNrZW5kX2ljbXAiOiJzZ3ItMDQzZDAyZGRmYjk3NDU5ODAiLCJiYWNrZW5kX291dGdvaW5nIjoic2dyLTBkZTEyMTE0ZDgwYWYwMmRlIiwiYmFja2VuZF9zc2hfaW5wdXQiOm51bGwsImJhY2tlbmRfc3NoX2xvY2FsIjoic2dyLTAwNDg5M2M3ZTFj"
            "created_by_module"               = "infrahouse/ecs/aws"
            "environment"                     = "development"
            "execution_role_arn"              = "arn:aws:iam::493370826424:role/terraform-registryTaskExecutionRole20241001134545661300000006"
            "instance_role_policy_attachment" = "terraform-registry-instance-u7h28mlvhf20241001134545584200000002-20241001134546521000000007"
            "instance_role_policy_name"       = "terraform-registry-instance-u7h28mlvhf2l20241001134545463900000001"
            "load_balancer_arn"               = "arn:aws:elasticloadbalancing:us-west-1:493370826424:loadbalancer/app/terraf2024030219493612940000000a/1f20b225c3278266"
          ~ "module_version"                  = "3.7.0" -> "3.8.0"
            "service"                         = "terraform-registry"
            "target_group_arn"                = "arn:aws:elasticloadbalancing:us-west-1:493370826424:targetgroup/tf-20240302194935067400000002/c7f427e0e1d228fe"
        }
      ~ tags_all                           = {
          ~ "module_version"                  = "3.7.0" -> "3.8.0"
            # (11 unchanged elements hidden)
        }
        # (15 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.ecs.aws_ecs_task_definition.ecs will be updated in-place
  ~ resource "aws_ecs_task_definition" "ecs" {
        id                       = "terraform-registry"
      ~ tags                     = {
            "account"           = "493370826424"
            "created_by_module" = "infrahouse/ecs/aws"
            "environment"       = "development"
          ~ "module_version"    = "3.7.0" -> "3.8.0"
            "service"           = "terraform-registry"
        }
      ~ tags_all                 = {
          ~ "module_version"    = "3.7.0" -> "3.8.0"
            # (5 unchanged elements hidden)
        }
        # (15 unchanged attributes hidden)
    }

  # module.ecs.aws_iam_role.ecs_task_execution_role will be updated in-place
  ~ resource "aws_iam_role" "ecs_task_execution_role" {
        id                    = "terraform-registryTaskExecutionRole20241001134545661300000006"
        name                  = "terraform-registryTaskExecutionRole20241001134545661300000006"
      ~ tags                  = {
            "account"           = "493370826424"
            "created_by_module" = "infrahouse/ecs/aws"
            "environment"       = "development"
          ~ "module_version"    = "3.7.0" -> "3.8.0"
            "service"           = "terraform-registry"
        }
      ~ tags_all              = {
          ~ "module_version"    = "3.7.0" -> "3.8.0"
            # (5 unchanged elements hidden)
        }
        # (11 unchanged attributes hidden)
    }

  # module.infrahouse-github-backup-app-key.data.external.secret_value will be read during apply
  # (config refers to values not yet known)
 <= data "external" "secret_value" {
      + id      = (known after apply)
      + program = [
          + "python",
          + ".terraform/modules/infrahouse-github-backup-app-key/assets/get_secret.py",
          + "us-west-1",
          + (known after apply),
          + "arn:aws:iam::493370826424:role/ih-tf-aws-control-493370826424-admin",
        ]
      + result  = (known after apply)
    }

  # module.infrahouse-github-backup-app-key.aws_secretsmanager_secret.secret will be created
  + resource "aws_secretsmanager_secret" "secret" {
      + arn                            = (known after apply)
      + description                    = "GitHub App infrahouse-github-backup PEM key"
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = (known after apply)
      + name_prefix                    = "infrahouse-github-backup"
      + policy                         = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "*"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::493370826424:role/ih-tf-aws-control-493370826424-admin"
                        }
                      + Resource  = "*"
                    },
                  + {
                      + Action    = [
                          + "secretsmanager:UpdateSecretVersionStage",
                          + "secretsmanager:UpdateSecret",
                          + "secretsmanager:RotateSecret",
                          + "secretsmanager:RestoreSecret",
                          + "secretsmanager:PutSecretValue",
                          + "secretsmanager:ListSecrets",
                          + "secretsmanager:ListSecretVersionIds",
                          + "secretsmanager:GetSecretValue",
                          + "secretsmanager:GetResourcePolicy",
                          + "secretsmanager:GetRandomPassword",
                          + "secretsmanager:DescribeSecret",
                          + "secretsmanager:CancelRotateSecret",
                          + "secretsmanager:BatchGetSecretValue",
                        ]
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::493370826424:role/aws-reserved/sso.amazonaws.com/us-west-1/AWSReservedSSO_AWSAdministratorAccess_a84a03e62f490b50"
                        }
                      + Resource  = "*"
                    },
                  + {
                      + Action    = [
                          + "secretsmanager:ValidateResourcePolicy",
                          + "secretsmanager:UntagResource",
                          + "secretsmanager:TagResource",
                          + "secretsmanager:StopReplicationToReplica",
                          + "secretsmanager:ReplicateSecretToRegions",
                          + "secretsmanager:RemoveRegionsFromReplication",
                          + "secretsmanager:PutResourcePolicy",
                          + "secretsmanager:DeleteSecret",
                          + "secretsmanager:DeleteResourcePolicy",
                          + "secretsmanager:CreateSecret",
                        ]
                      + Effect    = "Deny"
                      + Principal = {
                          + AWS = "arn:aws:iam::493370826424:role/aws-reserved/sso.amazonaws.com/us-west-1/AWSReservedSSO_AWSAdministratorAccess_a84a03e62f490b50"
                        }
                      + Resource  = "*"
                    },
                  + {
                      + Action    = [
                          + "secretsmanager:ListSecretVersionIds",
                          + "secretsmanager:GetSecretValue",
                          + "secretsmanager:GetResourcePolicy",
                          + "secretsmanager:GetRandomPassword",
                          + "secretsmanager:DescribeSecret",
                        ]
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::493370826424:role/jumphost-Zv01ElhajbB620240223005112032800000005"
                        }
                      + Resource  = "*"
                    },
                  + {
                      + Action    = [
                          + "secretsmanager:ValidateResourcePolicy",
                          + "secretsmanager:UpdateSecretVersionStage",
                          + "secretsmanager:UpdateSecret",
                          + "secretsmanager:UntagResource",
                          + "secretsmanager:TagResource",
                          + "secretsmanager:StopReplicationToReplica",
                          + "secretsmanager:RotateSecret",
                          + "secretsmanager:RestoreSecret",
                          + "secretsmanager:ReplicateSecretToRegions",
                          + "secretsmanager:RemoveRegionsFromReplication",
                          + "secretsmanager:PutSecretValue",
                          + "secretsmanager:PutResourcePolicy",
                          + "secretsmanager:ListSecrets",
                          + "secretsmanager:DeleteSecret",
                          + "secretsmanager:DeleteResourcePolicy",
                          + "secretsmanager:CreateSecret",
                          + "secretsmanager:CancelRotateSecret",
                          + "secretsmanager:BatchGetSecretValue",
                        ]
                      + Effect    = "Deny"
                      + Principal = {
                          + AWS = "arn:aws:iam::493370826424:role/jumphost-Zv01ElhajbB620240223005112032800000005"
                        }
                      + Resource  = "*"
                    },
                  + {
                      + Action    = "*"
                      + Condition = {
                          + StringNotLike = {
                              + "aws:PrincipalArn" = [
                                  + "arn:aws:iam::493370826424:role/ih-tf-aws-control-493370826424-admin",
                                  + "arn:aws:iam::493370826424:role/aws-reserved/sso.amazonaws.com/us-west-1/AWSReservedSSO_AWSAdministratorAccess_a84a03e62f490b50",
                                  + "arn:aws:iam::493370826424:role/jumphost-Zv01ElhajbB620240223005112032800000005",
                                ]
                            }
                        }
                      + Effect    = "Deny"
                      + Principal = {
                          + AWS = "*"
                        }
                      + Resource  = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + recovery_window_in_days        = 0
      + tags                           = {
          + "account"           = "493370826424"
          + "created_by_module" = "infrahouse/secret/aws"
          + "environment"       = "production"
          + "owner"             = "arn:aws:iam::493370826424:role/ih-tf-aws-control-493370826424-admin"
          + "service"           = "unknown"
        }
      + tags_all                       = {
          + "account"           = "493370826424"
          + "created_by"        = "infrahouse/aws-control-493370826424"
          + "created_by_module" = "infrahouse/secret/aws"
          + "environment"       = "production"
          + "owner"             = "arn:aws:iam::493370826424:role/ih-tf-aws-control-493370826424-admin"
          + "service"           = "unknown"
        }

      + replica (known after apply)
    }

  # module.infrahouse-github-backup-app-key.aws_secretsmanager_secret_version.current will be created
  + resource "aws_secretsmanager_secret_version" "current" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + secret_id      = (known after apply)
      + secret_string  = (sensitive value)
      + version_id     = (known after apply)
      + version_stages = [
          + "INITIAL",
        ]
    }

  # module.keycloak.aws_ecs_capacity_provider.ecs will be updated in-place
  ~ resource "aws_ecs_capacity_provider" "ecs" {
        id       = "arn:aws:ecs:us-west-1:493370826424:capacity-provider/auth"
        name     = "auth"
      ~ tags     = {
            "account"           = "493370826424"
            "created_by_module" = "infrahouse/ecs/aws"
            "environment"       = "development"
          ~ "module_version"    = "3.7.0" -> "3.8.0"
            "service"           = "auth"
        }
      ~ tags_all = {
          ~ "module_version"    = "3.7.0" -> "3.8.0"
            # (5 unchanged elements hidden)
        }
        # (1 unchanged attribute hidden)

        # (1 unchanged block hidden)
    }

  # module.keycloak.aws_ecs_cluster.ecs will be updated in-place
  ~ resource "aws_ecs_cluster" "ecs" {
        id       = "arn:aws:ecs:us-west-1:493370826424:cluster/auth"
        name     = "auth"
      ~ tags     = {
            "account"           = "493370826424"
            "created_by_module" = "infrahouse/ecs/aws"
            "environment"       = "development"
          ~ "module_version"    = "3.7.0" -> "3.8.0"
            "service"           = "auth"
        }
      ~ tags_all = {
          ~ "module_version"    = "3.7.0" -> "3.8.0"
            # (5 unchanged elements hidden)
        }
        # (1 unchanged attribute hidden)

        # (1 unchanged block hidden)
    }

  # module.keycloak.aws_ecs_service.ecs will be updated in-place
  ~ resource "aws_ecs_service" "ecs" {
        id                                 = "arn:aws:ecs:us-west-1:493370826424:service/auth/auth"
        name                               = "auth"
      ~ tags                               = {
            "account"                         = "493370826424"
            "backend_security_group"          = "eyJiYWNrZW5kIjp7ImlkIjoic2ctMDY1MzNlOTA2ZDc4NGIyYTUiLCJydWxlcyI6eyJiYWNrZW5kX2ljbXAiOiJzZ3ItMGRhOTVkMzY4ZWMwYmNiZGIiLCJiYWNrZW5kX291dGdvaW5nIjoic2dyLTA4NGE0YjRhNzk1NjI3NWU2IiwiYmFja2VuZF9zc2hfaW5wdXQiOm51bGwsImJhY2tlbmRfc3NoX2xvY2FsIjoic2dyLTBiYmI3OTIwMmRk"
            "created_by_module"               = "infrahouse/ecs/aws"
            "environment"                     = "development"
            "execution_role_arn"              = "arn:aws:iam::493370826424:role/authTaskExecutionRole20241001134545655900000005"
            "instance_role_policy_attachment" = "auth-instance-czqdboofg13020241001134545613900000004-20241001134546591300000008"
            "instance_role_policy_name"       = "auth-instance-czqdboofg13020241001134545611100000003"
            "load_balancer_arn"               = "arn:aws:elasticloadbalancing:us-west-1:493370826424:loadbalancer/app/auth2024030222363678900000000a/a26578ce41c8310c"
          ~ "module_version"                  = "3.7.0" -> "3.8.0"
            "service"                         = "auth"
            "target_group_arn"                = "arn:aws:elasticloadbalancing:us-west-1:493370826424:targetgroup/tf-20240302223634861300000006/781ece90bddd8d59"
        }
      ~ tags_all                           = {
          ~ "module_version"                  = "3.7.0" -> "3.8.0"
            # (11 unchanged elements hidden)
        }
        # (15 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.keycloak.aws_ecs_task_definition.ecs will be updated in-place
  ~ resource "aws_ecs_task_definition" "ecs" {
        id                       = "auth"
      ~ tags                     = {
            "account"           = "493370826424"
            "created_by_module" = "infrahouse/ecs/aws"
            "environment"       = "development"
          ~ "module_version"    = "3.7.0" -> "3.8.0"
            "service"           = "auth"
        }
      ~ tags_all                 = {
          ~ "module_version"    = "3.7.0" -> "3.8.0"
            # (5 unchanged elements hidden)
        }
        # (15 unchanged attributes hidden)
    }

  # module.keycloak.aws_iam_role.ecs_task_execution_role will be updated in-place
  ~ resource "aws_iam_role" "ecs_task_execution_role" {
        id                    = "authTaskExecutionRole20241001134545655900000005"
        name                  = "authTaskExecutionRole20241001134545655900000005"
      ~ tags                  = {
            "account"           = "493370826424"
            "created_by_module" = "infrahouse/ecs/aws"
            "environment"       = "development"
          ~ "module_version"    = "3.7.0" -> "3.8.0"
            "service"           = "auth"
        }
      ~ tags_all              = {
          ~ "module_version"    = "3.7.0" -> "3.8.0"
            # (5 unchanged elements hidden)
        }
        # (11 unchanged attributes hidden)
    }

  # module.ecs.module.pod.aws_autoscaling_group.website will be updated in-place
  ~ resource "aws_autoscaling_group" "website" {
        id                               = "terraf2024030219493674520000000d"
        name                             = "terraf2024030219493674520000000d"
        # (32 unchanged attributes hidden)

      - tag {
          - key                 = "parent_module_version" -> null
          - propagate_at_launch = true -> null
          - value               = "3.7.0" -> null
        }
      + tag {
          + key                 = "parent_module_version"
          + propagate_at_launch = true
          + value               = "3.8.0"
        }

        # (11 unchanged blocks hidden)
    }

  # module.keycloak.module.pod.aws_autoscaling_group.website will be updated in-place
  ~ resource "aws_autoscaling_group" "website" {
        id                               = "auth2024030222363784960000000d"
        name                             = "auth2024030222363784960000000d"
        # (32 unchanged attributes hidden)

      - tag {
          - key                 = "parent_module_version" -> null
          - propagate_at_launch = true -> null
          - value               = "3.7.0" -> null
        }
      + tag {
          + key                 = "parent_module_version"
          + propagate_at_launch = true
          + value               = "3.8.0"
        }

        # (11 unchanged blocks hidden)
    }

Plan: 2 to add, 12 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tf.plan

To perform exactly these actions, run the following command to apply:
    terraform apply "tf.plan"
```
</details>
<details><summary><i>metadata</i></summary>

```
eyJzMzovL2luZnJhaG91c2UtYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0L3RlcnJhZm9ybS50ZnN0YXRlIjogeyJzdWNjZXNzIjogdHJ1ZSwgImFkZCI6IDIsICJjaGFuZ2UiOiAxMiwgImRlc3Ryb3kiOiAwfX0=
```
</details>